OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic12f1572.h
#define PWM1OFL0                PWM1OFLbits.PWM1OFL0            // bit 0
#define PWM1OFL1                PWM1OFLbits.PWM1OFL1            // bit 1
#define PWM1OFL2                PWM1OFLbits.PWM1OFL2            // bit 2
#define PWM1OFL3                PWM1OFLbits.PWM1OFL3            // bit 3
#define PWM1OFL4                PWM1OFLbits.PWM1OFL4            // bit 4
#define PWM1OFL5                PWM1OFLbits.PWM1OFL5            // bit 5
#define PWM1OFL6                PWM1OFLbits.PWM1OFL6            // bit 6
#define PWM1OFL7                PWM1OFLbits.PWM1OFL7            // bit 7

#define PWM1PHH0                PWM1PHHbits.PWM1PHH0            // bit 0
#define PWM1PHH1                PWM1PHHbits.PWM1PHH1            // bit 1
#define PWM1PHH2                PWM1PHHbits.PWM1PHH2            // bit 2
#define PWM1PHH3                PWM1PHHbits.PWM1PHH3            // bit 3
#define PWM1PHH4                PWM1PHHbits.PWM1PHH4            // bit 4
#define PWM1PHH5                PWM1PHHbits.PWM1PHH5            // bit 5
#define PWM1PHH6                PWM1PHHbits.PWM1PHH6            // bit 6
#define PWM1PHH7                PWM1PHHbits.PWM1PHH7            // bit 7

#define PWM1PHL0                PWM1PHLbits.PWM1PHL0            // bit 0
#define PWM1PHL1                PWM1PHLbits.PWM1PHL1            // bit 1
#define PWM1PHL2                PWM1PHLbits.PWM1PHL2            // bit 2
#define PWM1PHL3                PWM1PHLbits.PWM1PHL3            // bit 3
#define PWM1PHL4                PWM1PHLbits.PWM1PHL4            // bit 4
#define PWM1PHL5                PWM1PHLbits.PWM1PHL5            // bit 5
#define PWM1PHL6                PWM1PHLbits.PWM1PHL6            // bit 6
#define PWM1PHL7                PWM1PHLbits.PWM1PHL7            // bit 7

#define PWM1PRH0                PWM1PRHbits.PWM1PRH0            // bit 0
#define PWM1PRH1                PWM1PRHbits.PWM1PRH1            // bit 1
#define PWM1PRH2                PWM1PRHbits.PWM1PRH2            // bit 2
#define PWM1PRH3                PWM1PRHbits.PWM1PRH3            // bit 3
#define PWM1PRH4                PWM1PRHbits.PWM1PRH4            // bit 4
#define PWM1PRH5                PWM1PRHbits.PWM1PRH5            // bit 5
#define PWM1PRH6                PWM1PRHbits.PWM1PRH6            // bit 6
#define PWM1PRH7                PWM1PRHbits.PWM1PRH7            // bit 7

#define PWM1PRL0                PWM1PRLbits.PWM1PRL0            // bit 0
#define PWM1PRL1                PWM1PRLbits.PWM1PRL1            // bit 1
#define PWM1PRL2                PWM1PRLbits.PWM1PRL2            // bit 2
#define PWM1PRL3                PWM1PRLbits.PWM1PRL3            // bit 3
#define PWM1PRL4                PWM1PRLbits.PWM1PRL4            // bit 4
#define PWM1PRL5                PWM1PRLbits.PWM1PRL5            // bit 5
#define PWM1PRL6                PWM1PRLbits.PWM1PRL6            // bit 6
#define PWM1PRL7                PWM1PRLbits.PWM1PRL7            // bit 7

#define PWM1TMRH0               PWM1TMRHbits.PWM1TMRH0          // bit 0
#define PWM1TMRH1               PWM1TMRHbits.PWM1TMRH1          // bit 1
#define PWM1TMRH2               PWM1TMRHbits.PWM1TMRH2          // bit 2
#define PWM1TMRH3               PWM1TMRHbits.PWM1TMRH3          // bit 3
#define PWM1TMRH4               PWM1TMRHbits.PWM1TMRH4          // bit 4
#define PWM1TMRH5               PWM1TMRHbits.PWM1TMRH5          // bit 5
#define PWM1TMRH6               PWM1TMRHbits.PWM1TMRH6          // bit 6
#define PWM1TMRH7               PWM1TMRHbits.PWM1TMRH7          // bit 7

#define PWM1TMRL0               PWM1TMRLbits.PWM1TMRL0          // bit 0
#define PWM1TMRL1               PWM1TMRLbits.PWM1TMRL1          // bit 1
#define PWM1TMRL2               PWM1TMRLbits.PWM1TMRL2          // bit 2
#define PWM1TMRL3               PWM1TMRLbits.PWM1TMRL3          // bit 3
#define PWM1TMRL4               PWM1TMRLbits.PWM1TMRL4          // bit 4
#define PWM1TMRL5               PWM1TMRLbits.PWM1TMRL5          // bit 5
#define PWM1TMRL6               PWM1TMRLbits.PWM1TMRL6          // bit 6
#define PWM1TMRL7               PWM1TMRLbits.PWM1TMRL7          // bit 7

#define PWM2DCH0                PWM2DCHbits.PWM2DCH0            // bit 0
#define PWM2DCH1                PWM2DCHbits.PWM2DCH1            // bit 1
#define PWM2DCH2                PWM2DCHbits.PWM2DCH2            // bit 2
#define PWM2DCH3                PWM2DCHbits.PWM2DCH3            // bit 3
#define PWM2DCH4                PWM2DCHbits.PWM2DCH4            // bit 4
#define PWM2DCH5                PWM2DCHbits.PWM2DCH5            // bit 5
#define PWM2DCH6                PWM2DCHbits.PWM2DCH6            // bit 6
#define PWM2DCH7                PWM2DCHbits.PWM2DCH7            // bit 7

#define PWM2DCL0                PWM2DCLbits.PWM2DCL0            // bit 0
#define PWM2DCL1                PWM2DCLbits.PWM2DCL1            // bit 1
#define PWM2DCL2                PWM2DCLbits.PWM2DCL2            // bit 2
#define PWM2DCL3                PWM2DCLbits.PWM2DCL3            // bit 3
#define PWM2DCL4                PWM2DCLbits.PWM2DCL4            // bit 4
#define PWM2DCL5                PWM2DCLbits.PWM2DCL5            // bit 5
#define PWM2DCL6                PWM2DCLbits.PWM2DCL6            // bit 6
#define PWM2DCL7                PWM2DCLbits.PWM2DCL7            // bit 7

#define PWM2OFH0                PWM2OFHbits.PWM2OFH0            // bit 0
#define PWM2OFH1                PWM2OFHbits.PWM2OFH1            // bit 1
#define PWM2OFH2                PWM2OFHbits.PWM2OFH2            // bit 2
#define PWM2OFH3                PWM2OFHbits.PWM2OFH3            // bit 3
#define PWM2OFH4                PWM2OFHbits.PWM2OFH4            // bit 4
#define PWM2OFH5                PWM2OFHbits.PWM2OFH5            // bit 5
#define PWM2OFH6                PWM2OFHbits.PWM2OFH6            // bit 6
#define PWM2OFH7                PWM2OFHbits.PWM2OFH7            // bit 7

#define PWM2OFL0                PWM2OFLbits.PWM2OFL0            // bit 0
#define PWM2OFL1                PWM2OFLbits.PWM2OFL1            // bit 1
#define PWM2OFL2                PWM2OFLbits.PWM2OFL2            // bit 2
#define PWM2OFL3                PWM2OFLbits.PWM2OFL3            // bit 3
#define PWM2OFL4                PWM2OFLbits.PWM2OFL4            // bit 4
#define PWM2OFL5                PWM2OFLbits.PWM2OFL5            // bit 5
#define PWM2OFL6                PWM2OFLbits.PWM2OFL6            // bit 6
#define PWM2OFL7                PWM2OFLbits.PWM2OFL7            // bit 7

#define PWM2PHH0                PWM2PHHbits.PWM2PHH0            // bit 0
#define PWM2PHH1                PWM2PHHbits.PWM2PHH1            // bit 1
#define PWM2PHH2                PWM2PHHbits.PWM2PHH2            // bit 2
#define PWM2PHH3                PWM2PHHbits.PWM2PHH3            // bit 3
#define PWM2PHH4                PWM2PHHbits.PWM2PHH4            // bit 4
#define PWM2PHH5                PWM2PHHbits.PWM2PHH5            // bit 5
#define PWM2PHH6                PWM2PHHbits.PWM2PHH6            // bit 6
#define PWM2PHH7                PWM2PHHbits.PWM2PHH7            // bit 7

#define PWM2PHL0                PWM2PHLbits.PWM2PHL0            // bit 0
#define PWM2PHL1                PWM2PHLbits.PWM2PHL1            // bit 1
#define PWM2PHL2                PWM2PHLbits.PWM2PHL2            // bit 2
#define PWM2PHL3                PWM2PHLbits.PWM2PHL3            // bit 3
#define PWM2PHL4                PWM2PHLbits.PWM2PHL4            // bit 4
#define PWM2PHL5                PWM2PHLbits.PWM2PHL5            // bit 5
#define PWM2PHL6                PWM2PHLbits.PWM2PHL6            // bit 6
#define PWM2PHL7                PWM2PHLbits.PWM2PHL7            // bit 7

#define PWM2PRH0                PWM2PRHbits.PWM2PRH0            // bit 0
#define PWM2PRH1                PWM2PRHbits.PWM2PRH1            // bit 1
#define PWM2PRH2                PWM2PRHbits.PWM2PRH2            // bit 2
#define PWM2PRH3                PWM2PRHbits.PWM2PRH3            // bit 3
#define PWM2PRH4                PWM2PRHbits.PWM2PRH4            // bit 4
#define PWM2PRH5                PWM2PRHbits.PWM2PRH5            // bit 5
#define PWM2PRH6                PWM2PRHbits.PWM2PRH6            // bit 6
#define PWM2PRH7                PWM2PRHbits.PWM2PRH7            // bit 7

#define PWM2PRL0                PWM2PRLbits.PWM2PRL0            // bit 0
#define PWM2PRL1                PWM2PRLbits.PWM2PRL1            // bit 1
#define PWM2PRL2                PWM2PRLbits.PWM2PRL2            // bit 2
#define PWM2PRL3                PWM2PRLbits.PWM2PRL3            // bit 3
#define PWM2PRL4                PWM2PRLbits.PWM2PRL4            // bit 4
#define PWM2PRL5                PWM2PRLbits.PWM2PRL5            // bit 5
#define PWM2PRL6                PWM2PRLbits.PWM2PRL6            // bit 6
#define PWM2PRL7                PWM2PRLbits.PWM2PRL7            // bit 7

